Repository: natd23111/LubokAntuRescueNet
Catalog: Lar-Frontend/lib/l10n/app_*.arb
Languages: ms

# howDoICheckReportStatus
source: How do I check my report status?
ms: Bagaimana saya memeriksa status laporan saya?

# whatAidProgramsAvailable
source: What aid programs are available?
ms: Program bantuan apa yang tersedia?

source: Emergency contact numbers
ms: Nombor hubungan kecemasan

# troubleGeneratingResponse
source: I'm having trouble generating a response. Please try again.
ms: Saya menghadapi masalah menjana respons. Sila cuba lagi.

source: Error parsing response:
ms: Ralat menghuraikan respons:

# errorConnectingAPI
source: Error connecting to Hugging Face API:
ms: Ralat menyambung ke API Hugging Face:

# apiTokenNotSet
source: Error: Hugging Face API token not set. Please update lib/config/hugging_face_config.dart with your token from https://huggingface.co/settings/tokens
ms: Ralat: Token API Hugging Face belum ditetapkan. Sila kemas kini lib/config/hugging_face_config.dart dengan token anda dari https://huggingface.co/settings/tokens
