Repository: natd23111/LubokAntuRescueNet
Catalog: Lar-Frontend/lib/l10n/app_*.arb
Languages: ms

# appDescription
source: Emergency and Community Aid Reporting System
ms: Sistem Pelaporan Bantuan Kecemasan dan Komuniti

source: Welcome
ms: Selamat Datang

source: Sign In
ms: Log Masuk

source: Sign Up
ms: Daftar

source: Logout
ms: Log Keluar

source: Email
ms: Emel

# enterEmail
source: Enter your email
ms: Masukkan emel anda

source: Password
ms: Kata laluan

source: Enter password
ms: Masukkan kata laluan

source: Citizen
ms: Penduduk

source: Admin
ms: Pentadbir

# dontHaveAccount
source: Don't have an account?
ms: Tidak ada akaun?

source: Register here
ms: Daftar di sini

source: Loading...
ms: Memuatkan...

source: Error
ms: Ralat

source: Success
ms: Berjaya

source: Failed
ms: Gagal

source: Cancel
ms: Batal

source: Delete
ms: Padam

source: Save
ms: Simpan

source: Back
ms: Kembali

source: Next
ms: Seterusnya

source: Submit
ms: Hantar

source: Sign in failed
ms: Log masuk gagal

# emailRequired
source: Please enter your email
ms: Sila masukkan emel anda

# passwordRequired
source: Please enter your password
ms: Sila masukkan kata laluan anda

# adminNotAuthorized
source: This email is not authorized as admin
ms: Emel ini tidak dibenarkan sebagai pentadbir

# unknownError
source: Unknown error occurred
ms: Ralat tidak diketahui berlaku

source: Dashboard
ms: Papan Pemuka

source: Profile
ms: Profil

source: Settings
ms: Tetapan

source: Language
ms: Bahasa

source: Citizen Dashboard
ms: Papan Pemuka Penduduk

source: Notification Settings
ms: Tetapan Pemberitahuan

source: Loading weather data...
ms: Memuatkan data cuaca...

source: Submit Emergency
ms: Hantar Kecemasan

source: Submit Aid Request
ms: Hantar Permintaan Bantuan

source: View Aid Requests
ms: Lihat Permintaan Bantuan

source: View Aid Programs
ms: Lihat Program Bantuan

source: Weather Alerts
ms: Amaran Cuaca

source: AI Chatbot
ms: Bot Soal Jawab AI

source: Admin Dashboard
ms: Papan Pemuka Pentadbir

source: Name
ms: Nama

# enterName
source: Enter your name
ms: Masukkan nama anda

source: Confirm Password
ms: Sahkan Kata Laluan

# confirmPasswordHint
source: Confirm your password
ms: Sahkan kata laluan anda

# passwordMismatch
source: Passwords do not match
ms: Kata laluan tidak sepadan

# nameRequired
source: Please enter your name
ms: Sila masukkan nama anda

# passwordTooShort
source: Password must be at least 6 characters
ms: Kata laluan mesti sekurang-kurangnya 6 aksara

source: Register
ms: Daftar

# alreadyHaveAccount
source: Already have an account?
ms: Sudah ada akaun?

source: Login here
ms: Log masuk di sini

source: Registration failed
ms: Pendaftaran gagal

source: User already exists
ms: Pengguna sudah wujud

source: Refreshing
ms: Menyegarkan

source: Error refreshing dashboard
ms: Ralat menyegarkan papan pemuka

source: Reports
ms: Laporan

source: Aid Requests
ms: Permintaan Bantuan

source: Aid Programs
ms: Program Bantuan

source: My Reports
ms: Laporan Saya

source: My Requests
ms: Permintaan Saya

source: Weather Details
ms: Butiran Cuaca

source: Select Location
ms: Pilih Lokasi

source: Submit Emergency Report
ms: Hantar Laporan Kecemasan

source: View Reports
ms: Lihat Laporan

source: Request Aid
ms: Minta Bantuan

source: Map Warnings
ms: Amaran Peta

source: Recent Activity
ms: Aktiviti Terkini

# createNewAccount
source: Create a new citizen account
ms: Buat akaun warganegara baru

source: Full Name
ms: Nama Penuh

source: Enter full name
ms: Masukkan nama penuh

source: IC Number
ms: Nombor IC

# enterICNumber
source: e.g., 950123-13-5678
ms: cth., 950123-13-5678

source: Phone No
ms: No. Telefon

source: Enter Phone No
ms: Masukkan No. Telefon

# passwordConfirm
source: Confirm Password
ms: Sahkan Kata Laluan

# enterPasswordConfirm
source: Confirm your password
ms: Sahkan kata laluan anda

# agreeTerms
source: I agree to the Terms & Conditions
ms: Saya bersetuju dengan Syarat & Ketentuan

# termsAndConditions
source: Terms & Conditions
ms: Syarat & Ketentuan

# iAgreeToTerms
source: You must agree to the Terms & Conditions
ms: Anda mesti bersetuju dengan Syarat & Ketentuan

# fullNameRequired
source: Please enter your full name
ms: Sila masukkan nama penuh anda

# icRequired
source: Please enter your IC number
ms: Sila masukkan nombor IC anda

# phoneRequired
source: Please enter your phone number
ms: Sila masukkan nombor telefon anda

source: Welcome back
ms: Selamat kembali

# checkAlerts
source: Check alerts and reports in your area
ms: Periksa amaran dan laporan di kawasan anda

source: Active Reports
ms: Laporan Aktif

source: New Programs
ms: Program Baru

source: Weather Alert
ms: Amaran Cuaca

source: Weather Update
ms: Kemas Kini Cuaca

# weatherUnavailable
source: Weather data unavailable
ms: Data cuaca tidak tersedia

source: Current Weather
ms: Cuaca Semasa

source: User Profile
ms: Profil Pengguna

# fullNameLabel
source: Full Name
ms: Nama Penuh

# emailLabel
source: Email
ms: E-mel

# phoneLabel
source: Phone
ms: Telefon

# icLabel
source: IC Number
ms: Nombor IC

source: Account Created
ms: Akaun Dibuat

# cantBeChanged
source: Cannot be changed
ms: Tidak boleh diubah

source: Change Password
ms: Ubah Kata Laluan

# passwordLabel
source: Password
ms: Kata Laluan

# minimumCharacters
source: Minimum 8 characters
ms: Minimum 8 aksara

# confirmPasswordLabel
source: Confirm Password
ms: Sahkan Kata Laluan

source: Re-enter password
ms: Masukkan semula kata laluan

source: Passwords do not match
ms: Kata laluan tidak sepadan

# agreeTermsPrivacy
source: I agree to the Terms & Conditions and Privacy Policy *
ms: Saya bersetuju dengan Syarat & Ketentuan dan Dasar Privasi *

# cancelButton
source: Cancel
ms: Batal

# emailMaxCharacters
source: Email max is 64 characters
ms: E-mel maksimum 64 aksara

# enterValidEmail
source: Enter a valid email
ms: Masukkan e-mel yang sah

# passwordMin8
source: Minimum 8 characters
ms: Minimum 8 aksara

# passwordMax20
source: Maximum 20 characters
ms: Maksimum 20 aksara

# enterPassword2
source: Please enter a password
ms: Sila masukkan kata laluan

# confirmPassword2
source: Please confirm your password
ms: Sila sahkan kata laluan anda

source: Address
ms: Alamat

# enterAddress
source: Enter your address
ms: Masukkan alamat anda

source: Account Information
ms: Maklumat Akaun

source: Update Profile
ms: Kemaskini Profil

source: Member since:
ms: Ahli sejak:

source: Current Password
ms: Kata Laluan Semasa

source: New Password
ms: Kata Laluan Baru

source: Profile updated successfully
ms: Profil dikemas kini dengan berjaya

# allPasswordFieldsRequired
source: All password fields are required
ms: Semua medan kata laluan diperlukan

source: Password changed successfully
ms: Kata laluan telah diubah dengan berjaya

source: User not authenticated
ms: Pengguna tidak disahkan

source: Enter your address
ms: Masukkan alamat anda

# currentPasswordIncorrect
source: Current password is incorrect
ms: Kata laluan semasa tidak betul

# newPasswordTooWeak
source: New password is too weak
ms: Kata laluan baru terlalu lemah

source: Error updating profile
ms: Ralat mengemas kini profil

source: Error changing password
ms: Ralat menukar kata laluan

source: Enter current password
ms: Masukkan kata laluan semasa

source: Enter new password
ms: Masukkan kata laluan baru

source: Confirm New Password
ms: Sahkan Kata Laluan Baru

source: Re-enter new password
ms: Masukkan semula kata laluan baru

source: Account Status:
ms: Status Akaun:

source: User ID:
ms: ID Pengguna:

# minimumPasswordLength
source: Minimum 8 characters
ms: Minimum 8 aksara

# passwordMustBeAtLeast8
source: Password must be at least 8 characters
ms: Kata laluan mesti sekurang-kurangnya 8 aksara

source: Fire Alerts
ms: Amaran Kebakaran

# fireIncidents
source: Fire incidents in your area
ms: Kejadian kebakaran di kawasan anda

source: Landslide Warnings
ms: Amaran Tanah Runtuh

# landslideRisk
source: Landslide risk notifications
ms: Notifikasi risiko tanah runtuh

source: Weather Warnings
ms: Amaran Cuaca

source: Severe weather updates
ms: Kemas kini cuaca buruk

# connectedToTelegram
source: Connected to @rescuenet_bot
ms: Bersambung ke @rescuenet_bot

# receiveAlertsVia
source: Receive alerts via Telegram
ms: Terima makluman melalui Telegram

# connectYourTelegramAccount
source: Connect your Telegram account to receive instant alerts
ms: Sambungkan akaun Telegram anda untuk menerima makluman serta-merta

source: Connect Telegram
ms: Sambung Telegram

# linkedToTelegram
source: Connected to Telegram
ms: Bersambung ke Telegram

source: Disconnect Telegram
ms: Putuskan Sambungan Telegram

# disconnectConfirmTitle
source: Disconnect Telegram
ms: Putuskan Sambungan Telegram

# disconnectConfirmMessage
source: Are you sure you want to disconnect your Telegram account? You will stop receiving Telegram alerts.
ms: Adakah anda pasti ingin memutuskan sambungan akaun Telegram anda? Anda tidak akan lagi menerima makluman Telegram.

# telegramDisconnected
source: Telegram account disconnected
ms: Akaun Telegram telah diputuskan sambungannya

source: Clear All Notifications
ms: Padamkan Semua Makluman

source: Recent Notifications
ms: Makluman Terkini

source: No notifications yet
ms: Tiada makluman lagi

source: Mark as read
ms: Tandakan sebagai dibaca

source: Test Notifications
ms: Makluman Ujian

source: Flood Alert
ms: Amaran Banjir

source: Thunderstorm
ms: Ribut Petir

source: 🌧️ Heavy Rainfall Warning
ms: 🌧️ Amaran Hujan Lebat

# heavyRainfallExpected
source: Heavy rainfall expected in {location}
ms: Hujan lebat dijangka di {location}

source: ⛈️ Thunderstorm Alert
ms: ⛈️ Amaran Ribut Petir

# severeThunderstormWarning
source: Severe thunderstorm warning for {location}
ms: Amaran ribut petir teruk untuk {location}

source: Alert Types
ms: Jenis Amaran

source: Telegram Alerts
ms: Makluman Telegram

# newNotifications
source: {count} new
ms: {count} baru

source: Flood Warnings
ms: Amaran Banjir

# floodWarningsDesc
source: Heavy rainfall and flooding alerts
ms: Makluman hujan lebat dan banjir

# clearAllNotificationsTitle
source: Clear All Notifications
ms: Padamkan Semua Makluman

# clearAllNotificationsDesc
source: Are you sure you want to clear all notifications? This action cannot be undone.
ms: Adakah anda pasti ingin memadam semua makluman? Tindakan ini tidak boleh dibatalkan.

source: Clear All
ms: Padamkan Semua

source: Select emergency type
ms: Pilih jenis kecemasan

# emergencyTypeLabel
source: Emergency Type
ms: Jenis Kecemasan

# locationLabel
source: Location
ms: Lokasi

source: Enter location or address
ms: Masukkan lokasi atau alamat

source: Use Current Location on Map
ms: Gunakan Lokasi Semasa di Peta

# dateLabel
source: Date
ms: Tarikh

source: Auto-filled with current date
ms: Diisi secara automatik dengan tarikh semasa

# descriptionLabel
source: Description
ms: Penerangan

# provideDetailedDescription
source: Provide detailed description of the emergency
ms: Sediakan penerangan terperinci tentang kecemasan

source: Upload Images
ms: Muat Naik Imej

# maximumImagesConstraint
source: Maximum 3 images, up to 5MB each
ms: Maksimum 3 imej, sehingga 5MB setiap satu

# clickToUploadOrDragDrop
source: Click to upload or drag and drop
ms: Klik untuk muat naik atau seret dan lepas

source: PNG, JPG up to 5MB
ms: PNG, JPG sehingga 5MB

# chooseImages
source: Choose Images ({current}/{max})
ms: Pilih Imej ({current}/{max})

source: Max Images Reached
ms: Maksimum Imej Dicapai

source: Submit Report
ms: Hantar Laporan

# clearOrReset
source: Clear / Reset
ms: Padamkan / Tetapkan Semula

# pleaseSelectEmergencyType
source: Please select an emergency type
ms: Sila pilih jenis kecemasan

# pleaseEnterLocation
source: Please enter a location
ms: Sila masukkan lokasi

# pleaseProvideDescription
source: Please provide a description
ms: Sila sediakan penerangan

# couldNotDetermineLocation
source: Could not determine location. Please use map picker.
ms: Tidak dapat menentukan lokasi. Sila gunakan pemilih peta.

# failedToCreateReport
source: Failed to create report. Please try again.
ms: Gagal mencipta laporan. Sila cuba lagi.

# errorSubmittingReport
source: Error submitting report: {error}
ms: Ralat menghantar laporan: {error}

# uploadedReportButFailedImages
source: Uploaded report but failed to upload images: {error}
ms: Laporan dimuat naik tetapi gagal muat naik imej: {error}

# errorGettingLocation
source: Error getting location: {error}
ms: Ralat mendapatkan lokasi: {error}

# maximum3ImagesAllowed
source: Maximum 3 images allowed. Remove an image to add more.
ms: Maksimum 3 imej dibenarkan. Keluarkan imej untuk menambah lebih banyak.

# noValidImagesSelected
source: No valid images selected. Max 5MB per image.
ms: Tiada imej sah dipilih. Maksimum 5MB setiap imej.

# addedImages
source: Added {count} image(s)
ms: Menambah {count} imej

# addedImagesSkipped
source: Added {count} image(s) ({skipped} skipped)
ms: Menambah {count} imej ({skipped} dilewati)

source: Image removed
ms: Imej dikeluarkan

# locationServicesDisabled
source: Location services disabled. Please enter location or use map picker.
ms: Perkhidmatan lokasi dilumpuhkan. Sila masukkan lokasi atau gunakan pemilih peta.

# locationPermissionDenied
source: Location permission was denied.
ms: Kebenaran lokasi dinafikan.

# locationServicesAreDisabled
source: Location services are disabled. Please enable them.
ms: Perkhidmatan lokasi dilumpuhkan. Sila dayakannya.

source: Location permission was denied.
ms: Kebenaran lokasi dinafikan.

# locationPermissionsPermanentlyDenied
source: Location permissions are permanently denied. Open app settings to enable.
ms: Kebenaran lokasi ditolak secara kekal. Buka tetapan aplikasi untuk mendayakan.

# locationSelected
source: Location selected: {address}
ms: Lokasi dipilih: {address}

source: Report Submitted Successfully!
ms: Laporan Dihantar Dengan Berjaya!

# yourEmergencyReportHasBeenReceived
source: Your emergency report has been received. Reference: {reference}
ms: Laporan kecemasan anda telah diterima. Rujukan: {reference}

# pleaseSignInBeforeSubmitting
source: Please sign in before submitting a report.
ms: Sila log masuk sebelum menghantar laporan.

# floodOption
source: Flood
ms: Banjir

# fireOption
source: Fire
ms: Kebakaran

# accidentOption
source: Accident
ms: Kemalangan

# medicalEmergencyOption
source: Medical Emergency
ms: Kecemasan Perubatan

# landslideOption
source: Landslide
ms: Tanah Runtuh

# otherOption
source: Other
ms: Lain-lain

source: Report Status
ms: Status Laporan

source: All Reports
ms: Semua Laporan

source: Search by type or location
ms: Cari mengikut jenis atau lokasi

source: No reports found
ms: Tiada laporan ditemui

source: Filter by Type
ms: Tapis Mengikut Jenis

source: Report Details
ms: Butiran Laporan

source: Report ID
ms: ID Laporan

# typeLabel
source: Type
ms: Jenis

# locationField
source: Location
ms: Lokasi

source: Date Reported
ms: Tarikh Dilaporkan

# descriptionField
source: Description
ms: Penerangan

# imageLabel
source: Image
ms: Imej

# imagesLabel
source: Images
ms: Imej

source: Status Timeline
ms: Garis Masa Status

source: Report Submitted
ms: Laporan Dihantar

source: Under Review
ms: Dalam Semakan

source: Resolved
ms: Diselesaikan

source: Pending
ms: Tertangguh

source: Back to Reports
ms: Kembali ke Laporan

source: Unresolved
ms: Tidak Diselesaikan

source: In Progress
ms: Dalam Proses

# by
source: By {reporter} • {date}
ms: Oleh {reporter} • {date}

source: Aid Request Submitted!
ms: Permintaan Bantuan Dihantar!

# yourRequestHasBeenReceived
source: Your request has been received. Reference: {reference}
ms: Permintaan anda telah diterima. Rujukan: {reference}

source: Aid Type / Category
ms: Jenis / Kategori Bantuan

source: Select aid type
ms: Pilih jenis bantuan

source: Financial Aid
ms: Bantuan Kewangan

source: Disaster Relief
ms: Bantuan Bencana

source: Medical Emergency Fund
ms: Dana Kecemasan Perubatan

source: Education Aid
ms: Bantuan Pendidikan

source: Housing Assistance
ms: Bantuan Perumahan

source: Household Details
ms: Butiran Isi Rumah

# monthlyHouseholdIncome
source: Monthly Household Income (RM)
ms: Pendapatan Isi Rumah Bulanan (RM)

source: Enter monthly income
ms: Masukkan pendapatan bulanan

source: Number of Family Members
ms: Bilangan Ahli Keluarga

source: Enter number
ms: Masukkan nombor

source: Family Members Details
ms: Butiran Ahli Keluarga

# memberTitle
source: Member {index}
ms: Ahli {index}

# nameHint
source: Name
ms: Nama

source: Student
ms: Pelajar

source: Employed / Full-time
ms: Bekerja / Sepenuh Masa

source: Part-time Worker
ms: Pekerja Separuh Masa

source: Unemployed
ms: Menganggur

source: Retired
ms: Bersara

source: Child (Under 12)
ms: Kanak-kanak (Di bawah 12)

source: Description / Reason
ms: Penerangan / Sebab

# explainWhyYouNeedAid
source: Explain why you need this aid
ms: Terangkan mengapa anda memerlukan bantuan ini

source: Submission Date
ms: Tarikh Hantar

# autoFilledCurrentDate
source: Auto-filled with current date
ms: Diisi secara automatik dengan tarikh semasa

# submitRequestButton
source: Submit Request
ms: Hantar Permintaan

# clearResetButton
source: Clear / Reset
ms: Padamkan / Tetapkan Semula

source: Add Family Member
ms: Tambah Ahli Keluarga

# selectAidTypeValidation
source: Please select an aid type
ms: Sila pilih jenis bantuan

# enterIncomeValidation
source: Please enter monthly household income
ms: Sila masukkan pendapatan isi rumah bulanan

# familyMembersValidation
source: Please add at least one family member
ms: Sila tambah sekurang-kurangnya satu ahli keluarga

# descriptionValidation
source: Please provide a description
ms: Sila sediakan penerangan

# maximumFamilyMembers
source: Maximum of 20 family members allowed
ms: Maksimum 20 ahli keluarga dibenarkan

source: Failed to submit request
ms: Gagal menghantar permintaan

source: My Aid Requests
ms: Permohonan Bantuan Saya

source: Approved
ms: Diluluskan

source: Rejected
ms: Ditolak

source: Processing
ms: Diproses

source: Search aid requests
ms: Cari permohonan bantuan

# allRequests
source: All
ms: Semua

# financialAidFilter
source: Financial Aid
ms: Bantuan Kewangan

# disasterReliefFilter
source: Disaster Relief
ms: Bantuan Bencana

# educationAidFilter
source: Education Aid
ms: Bantuan Pendidikan

# medicalFundFilter
source: Medical Fund
ms: Dana Perubatan

source: No aid requests found
ms: Tiada permohonan bantuan dijumpai

source: Request Details
ms: Butiran Permintaan

# requestIdLabel
source: Request ID
ms: ID Permintaan

# aidTypeLabel
source: Aid Type
ms: Jenis Bantuan

# icNumberLabel
source: IC Number
ms: Nombor KP

# addressLabel
source: Address
ms: Alamat

# dateSubmittedLabel
source: Date Submitted
ms: Tarikh Dihantar

# monthlyIncomeLabel
source: Monthly Income
ms: Pendapatan Bulanan

# familyMembersLabel
source: Family Members
ms: Ahli Keluarga

source: Family Composition
ms: Komposisi Keluarga

source: Back to List
ms: Kembali ke Senarai

# errorPrefix
source: Error:
ms: Ralat:

# pendingTabLabel
source: Pending ({count})
ms: Tertangguh ({count})

# approvedTabLabel
source: Approved ({count})
ms: Diluluskan ({count})

# rejectedTabLabel
source: Rejected ({count})
ms: Ditolak ({count})

# housingAssistanceFilter
source: Housing Assistance
ms: Bantuan Perumahan

# otherCategoryFilter
source: Other
ms: Lain-lain

# medicalEmergencyFundFilter
source: Medical Emergency Fund
ms: Dana Kecemasan Perubatan

source: Available Aid Programs
ms: Program Bantuan Tersedia

source: Filter by Category
ms: Tapis mengikut Kategori

source: All Programs
ms: Semua Program

# financialAidCategory
source: Financial Aid
ms: Bantuan Kewangan

# disasterReliefCategory
source: Disaster Relief
ms: Bantuan Bencana

# medicalCategory
source: Medical
ms: Perubatan

# educationCategory
source: Education
ms: Pendidikan

# housingCategory
source: Housing
ms: Perumahan

source: No programs available
ms: Tiada program tersedia

# noProgramsMatch
source: No aid programs match the selected category
ms: Tiada program bantuan yang sepadan dengan kategori yang dipilih

source: Failed to load programs
ms: Gagal memuatkan program

source: Retry
ms: Cuba Semula

source: Program Details
ms: Butiran Program

# programIdLabel
source: Program ID
ms: ID Program

# titleLabel
source: Title
ms: Tajuk

# categoryLabel
source: Category
ms: Kategori

# startDateLabel
source: Start Date
ms: Tarikh Mula

# endDateLabel
source: End Date
ms: Tarikh Tamat

# eligibilityCriteriaLabel
source: Eligibility Criteria
ms: Kriteria Kelayakan

# aidAmountLabel
source: Aid Amount
ms: Jumlah Bantuan

source: How to Apply
ms: Cara Memohon

# applyStep1
source: Go to "Request Aid" section
ms: Pergi ke bahagian "Minta Bantuan"

# applyStep2
source: Select the appropriate aid category
ms: Pilih kategori bantuan yang sesuai

# applyStep3
source: Fill in your household details
ms: Isi butiran isi rumah anda

# applyStep4
source: Submit the request form
ms: Hantar borang permohonan

# applyStep5
source: Wait for approval notification
ms: Tunggu pemberitahuan kelulusan

source: Important Note
ms: Nota Penting

# applicationNoteText
source: Applications will be reviewed within 7-14 working days. You will be notified via email and in-app notification.
ms: Permohonan akan disemak dalam tempoh 7-14 hari kerja. Anda akan dimaklumkan melalui e-mel dan pemberitahuan dalam aplikasi.

source: Apply for This Program
ms: Mohon untuk Program Ini

source: No description available
ms: Tiada penerangan tersedia

# notApplicable
source: N/A
ms: T/A

# locationServices
source: Location services are disabled. Please enable them.
ms: Perkhidmatan lokasi dilumpuhkan. Sila dayakan ia.

# locationPermissionPermanent
source: Location permissions are permanently denied. Open app settings to enable.
ms: Kebenaran lokasi ditolak secara kekal. Buka tetapan aplikasi untuk dayakan.

source: Locating you...
ms: Mencari lokasi anda...

source: Centered on your location
ms: Berpusat pada lokasi anda

# errorLocating
source: Error locating: {error}
ms: Ralat mencari: {error}

# severityLabel
source: Severity
ms: Tahap Keterukan

# distanceLabel
source: Distance
ms: Jarak

# timeAgoLabel
source: Time ago
ms: Masa lalu

source: Zoom In
ms: Zum Masuk

source: Zoom Out
ms: Zum Keluar

# closeButton
source: Close
ms: Tutup

# backButton
source: Back
ms: Kembali

source: Your Current Location
ms: Lokasi Semasa Anda

source: Tap to locate on map
ms: Tekan untuk mencari di peta

source: Active Warnings Nearby
ms: Amaran Aktif Berdekatan

source: No warnings in your area
ms: Tiada amaran di kawasan anda

source: Warning Levels
ms: Tahap Amaran

source: High - Immediate danger
ms: Tinggi - Bahaya segera

source: Medium - Exercise caution
ms: Sederhana - Berhati-hati

source: Low - Be aware
ms: Rendah - Perlu diketahui

source: Refresh Map
ms: Segarkan Peta

# youMarker
source: You
ms: Anda

# noWarningsAvailable
source: No warnings available for your area
ms: Tiada amaran tersedia untuk kawasan anda

# warningDetailsTitle
source: Warning Details
ms: Butiran Amaran

# highSeverity
source: HIGH
ms: TINGGI

# mediumSeverity
source: MEDIUM
ms: SEDERHANA

# lowSeverity
source: LOW
ms: RENDAH

source: AI Assistant
ms: Pembantu AI

# aiGreeting
source: Hello! I am the RescueNet AI Assistant. I can help you with emergency procedures, disaster preparedness, aid information, and answer questions about the rescue network. How can I assist you today?
ms: Halo! Saya adalah Pembantu AI RescueNet. Saya dapat membantu anda dengan prosedur kecemasan, kesiapsiagaan bencana, maklumat bantuan, dan menjawab soalan tentang rangkaian penyelamat. Bagaimana saya boleh membantu anda hari ini?

source: Type your message...
ms: Taipkan mesej anda...

source: Quick questions:
ms: Soalan pantas:

# whatShouldIDoDuringFlood
source: What should I do during a flood?
ms: Apa yang perlu saya lakukan semasa banjir?
